*** Document Generation
1. The output for this file is =fizzbuzz.py=.
2. The web page for this file is =index.html=. It is structured to work with Github pages.
3. To generate these files, navigate into the source block and use =M-x org-babel-execute-src-block=. 
#+NAME: generate-files
#+BEGIN_SRC elisp
  ;; label for search: qqz
  ;; generate general-problem-solver.lisp
  (org-babel-tangle)
  ;; generate docs/index.html
  (org-html-export-as-html)
  (save-current-buffer
    (set-buffer "*Org HTML Export*")
    (write-file "index.html")
    (kill-buffer))
  (concat "Files Generated: " (current-time-string))
#+END_SRC 

#+RESULTS: generate-files
: Files Generated: Sat Jan 28 21:09:43 2017

